ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_srss.h
/***************************************************************************//**
* \file cyip_srss.h
*
* \brief
* SRSS IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_SRSS_H_
#define _CYIP_SRSS_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                           SRSS                                            ================ */
/* =========================================================================================================================== */

#define MCWDT_STRUCT_SECTION_SIZE   0x00000040UL
#define CLK_CSV_SECTION_SIZE        0x00000010UL
#define SRSS_SECTION_SIZE           0x00010000UL

/**
  * \brief Multi-Counter Watchdog Timer (MCWDT_STRUCT)
  */
typedef struct {
   __IM uint32_t RESERVED;
  __IOM uint32_t MCWDT_CNTLOW;                  /*!< 0x00000004 Multi-Counter Watchdog Sub-counters 0/1                        */
  __IOM uint32_t MCWDT_CNTHIGH;                 /*!< 0x00000008 Multi-Counter Watchdog Sub-counter 2                           */
  __IOM uint32_t MCWDT_MATCH;                   /*!< 0x0000000C Multi-Counter Watchdog Counter Match Register                  */
  __IOM uint32_t MCWDT_CONFIG;                  /*!< 0x00000010 Multi-Counter Watchdog Counter Configuration                   */
  __IOM uint32_t MCWDT_CTL;                     /*!< 0x00000014 Multi-Counter Watchdog Counter Control                         */
  __IOM uint32_t MCWDT_INTR;                    /*!< 0x00000018 Multi-Counter Watchdog Counter Interrupt Register              */
  __IOM uint32_t MCWDT_INTR_SET;                /*!< 0x0000001C Multi-Counter Watchdog Counter Interrupt Set Register          */
  __IOM uint32_t MCWDT_INTR_MASK;               /*!< 0x00000020 Multi-Counter Watchdog Counter Interrupt Mask Register         */
   __IM uint32_t MCWDT_INTR_MASKED;             /*!< 0x00000024 Multi-Counter Watchdog Counter Interrupt Masked Register       */
  __IOM uint32_t MCWDT_LOCK;                    /*!< 0x00000028 Multi-Counter Watchdog Counter Lock Register                   */
   __IM uint32_t RESERVED1[5];
} MCWDT_STRUCT_Type;                            /*!< Size = 44 (0x2C)                                                          */

/**
  * \brief SRSS Clock Supervisor (CSV) registers (CLK_CSV)
  */
typedef struct {
  __IOM uint32_t HF_CTL;                        /*!< 0x00000000 HFCLK Clock Supervision Control Register                       */
  __IOM uint32_t HF_LIMIT;                      /*!< 0x00000004 HFCLK Clock Supervision Limit Register                         */
   __IM uint32_t HF_CNT;                        /*!< 0x00000008 HFCLK Clock Supervision Count Register                         */
   __IM uint32_t RESERVED;
} CLK_CSV_Type;                                 /*!< Size = 12 (0xC)                                                           */

/**
  * \brief SRSS Core Registers (SRSS)
  */
typedef struct {                                /*!< SRSS Structure                                                            */
  __IOM uint32_t PWR_CTL;                       /*!< 0x00000000 Power Mode Control                                             */
  __IOM uint32_t PWR_HIBERNATE;                 /*!< 0x00000004 HIBERNATE Mode Register                                        */
  __IOM uint32_t PWR_LVD_CTL;                   /*!< 0x00000008 Low Voltage Detector (LVD) Configuration Register              */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t PWR_BUCK_CTL;                  /*!< 0x00000014 SIMO Buck Control Register                                     */
  __IOM uint32_t PWR_BUCK_CTL2;                 /*!< 0x00000018 SIMO Buck Control Register 2                                   */
   __IM uint32_t PWR_LVD_STATUS;                /*!< 0x0000001C Low Voltage Detector (LVD) Status Register                     */
   __IM uint32_t RESERVED1[24];
  __IOM uint32_t PWR_HIB_DATA[16];              /*!< 0x00000080 HIBERNATE Data Register                                        */
   __IM uint32_t RESERVED2[48];
  __IOM uint32_t WDT_CTL;                       /*!< 0x00000180 Watchdog Counter Control Register                              */
  __IOM uint32_t WDT_CNT;                       /*!< 0x00000184 Watchdog Counter Count Register                                */
  __IOM uint32_t WDT_MATCH;                     /*!< 0x00000188 Watchdog Counter Match Register                                */
   __IM uint32_t RESERVED3[29];
        MCWDT_STRUCT_Type MCWDT_STRUCT[4];      /*!< 0x00000200 Multi-Counter Watchdog Timer                                   */
  __IOM uint32_t CLK_DSI_SELECT[16];            /*!< 0x00000300 Clock DSI Select Register                                      */
  __IOM uint32_t CLK_PATH_SELECT[16];           /*!< 0x00000340 Clock Path Select Register                                     */
  __IOM uint32_t CLK_ROOT_SELECT[16];           /*!< 0x00000380 Clock Root Select Register                                     */
   __IM uint32_t RESERVED4[16];
        CLK_CSV_Type CLK_CSV[16];               /*!< 0x00000400 SRSS Clock Supervisor (CSV) registers                          */
  __IOM uint32_t CLK_SELECT;                    /*!< 0x00000500 Clock selection register                                       */
  __IOM uint32_t CLK_TIMER_CTL;                 /*!< 0x00000504 Timer Clock Control Register                                   */
  __IOM uint32_t CLK_CSV_WCO_CTL;               /*!< 0x00000508 WCO Clock Supervision Control Register                         */
  __IOM uint32_t CLK_ILO_CONFIG;                /*!< 0x0000050C HVILO Configuration                                            */
  __IOM uint32_t CLK_IMO_CONFIG;                /*!< 0x00000510 IMO Configuration                                              */
  __IOM uint32_t CLK_OUTPUT_FAST;               /*!< 0x00000514 Fast Clock Output Select Register                              */
  __IOM uint32_t CLK_OUTPUT_SLOW;               /*!< 0x00000518 Slow Clock Output Select Register                              */
  __IOM uint32_t CLK_CAL_CNT1;                  /*!< 0x0000051C Clock Calibration Counter 1                                    */
   __IM uint32_t CLK_CAL_CNT2;                  /*!< 0x00000520 Clock Calibration Counter 2                                    */
   __IM uint32_t RESERVED5[2];
  __IOM uint32_t CLK_ECO_CONFIG;                /*!< 0x0000052C ECO Configuration Register                                     */
   __IM uint32_t CLK_ECO_STATUS;                /*!< 0x00000530 ECO Status Register                                            */
   __IM uint32_t RESERVED6;
  __IOM uint32_t CLK_WCO_DPLL;                  /*!< 0x00000538 WCO DPLL Register                                              */
  __IOM uint32_t CLK_PILO_CONFIG;               /*!< 0x0000053C Precision ILO Configuration Register                           */
   __IM uint32_t RESERVED7[16];
  __IOM uint32_t CLK_FLL_CONFIG;                /*!< 0x00000580 FLL Configuration Register                                     */
  __IOM uint32_t CLK_FLL_CONFIG2;               /*!< 0x00000584 FLL Configuration Register 2                                   */
  __IOM uint32_t CLK_FLL_CONFIG3;               /*!< 0x00000588 FLL Configuration Register 3                                   */
  __IOM uint32_t CLK_FLL_CONFIG4;               /*!< 0x0000058C FLL Configuration Register 4                                   */
  __IOM uint32_t CLK_FLL_STATUS;                /*!< 0x00000590 FLL Status Register                                            */
   __IM uint32_t RESERVED8[27];
  __IOM uint32_t CLK_PLL_CONFIG[15];            /*!< 0x00000600 PLL Configuration Register                                     */
   __IM uint32_t RESERVED9;
  __IOM uint32_t CLK_PLL_STATUS[15];            /*!< 0x00000640 PLL Status Register                                            */
   __IM uint32_t RESERVED10[33];
  __IOM uint32_t SRSS_INTR;                     /*!< 0x00000700 SRSS Interrupt Register                                        */
  __IOM uint32_t SRSS_INTR_SET;                 /*!< 0x00000704 SRSS Interrupt Set Register                                    */
  __IOM uint32_t SRSS_INTR_MASK;                /*!< 0x00000708 SRSS Interrupt Mask Register                                   */
   __IM uint32_t SRSS_INTR_MASKED;              /*!< 0x0000070C SRSS Interrupt Masked Register                                 */
  __IOM uint32_t SRSS_INTR_CFG;                 /*!< 0x00000710 SRSS Interrupt Configuration Register                          */
   __IM uint32_t RESERVED11[59];
  __IOM uint32_t RES_CAUSE;                     /*!< 0x00000800 Reset Cause Observation Register                               */
  __IOM uint32_t RES_CAUSE2;                    /*!< 0x00000804 Reset Cause Observation Register 2                             */
   __IM uint32_t RESERVED12[7614];
  __IOM uint32_t PWR_TRIM_REF_CTL;              /*!< 0x00007F00 Reference Trim Register                                        */
  __IOM uint32_t PWR_TRIM_BODOVP_CTL;           /*!< 0x00007F04 BOD/OVP Trim Register                                          */
  __IOM uint32_t CLK_TRIM_CCO_CTL;              /*!< 0x00007F08 CCO Trim Register                                              */
  __IOM uint32_t CLK_TRIM_CCO_CTL2;             /*!< 0x00007F0C CCO Trim Register 2                                            */
   __IM uint32_t RESERVED13[8];
  __IOM uint32_t PWR_TRIM_WAKE_CTL;             /*!< 0x00007F30 Wakeup Trim Register                                           */
   __IM uint32_t RESERVED14[8183];
  __IOM uint32_t PWR_TRIM_LVD_CTL;              /*!< 0x0000FF10 LVD Trim Register                                              */
   __IM uint32_t RESERVED15;
  __IOM uint32_t CLK_TRIM_ILO_CTL;              /*!< 0x0000FF18 ILO Trim Register                                              */
  __IOM uint32_t PWR_TRIM_PWRSYS_CTL;           /*!< 0x0000FF1C Power System Trim Register                                     */
  __IOM uint32_t CLK_TRIM_ECO_CTL;              /*!< 0x0000FF20 ECO Trim Register                                              */
  __IOM uint32_t CLK_TRIM_PILO_CTL;             /*!< 0x0000FF24 PILO Trim Register                                             */
  __IOM uint32_t CLK_TRIM_PILO_CTL2;            /*!< 0x0000FF28 PILO Trim Register 2                                           */
  __IOM uint32_t CLK_TRIM_PILO_CTL3;            /*!< 0x0000FF2C PILO Trim Register 3                                           */
} SRSS_Type;                                    /*!< Size = 65328 (0xFF30)                                                     */


/* ===============================================  MCWDT_STRUCT.MCWDT_CNTLOW  =============================================== */
#define MCWDT_STRUCT_MCWDT_CNTLOW_WDT_CTR0_Pos (0UL)            /*!< MCWDT_STRUCT MCWDT_CNTLOW: WDT_CTR0 (Bit 0)               */
#define MCWDT_STRUCT_MCWDT_CNTLOW_WDT_CTR0_Msk (0xffffUL)       /*!< MCWDT_STRUCT MCWDT_CNTLOW: WDT_CTR0 (Bitfield-Mask: 0xffff)*/
#define MCWDT_STRUCT_MCWDT_CNTLOW_WDT_CTR1_Pos (16UL)           /*!< MCWDT_STRUCT MCWDT_CNTLOW: WDT_CTR1 (Bit 16)              */
#define MCWDT_STRUCT_MCWDT_CNTLOW_WDT_CTR1_Msk (0xffff0000UL)   /*!< MCWDT_STRUCT MCWDT_CNTLOW: WDT_CTR1 (Bitfield-Mask: 0xffff)*/
/* ==============================================  MCWDT_STRUCT.MCWDT_CNTHIGH  =============================================== */
#define MCWDT_STRUCT_MCWDT_CNTHIGH_WDT_CTR2_Pos (0UL)           /*!< MCWDT_STRUCT MCWDT_CNTHIGH: WDT_CTR2 (Bit 0)              */
#define MCWDT_STRUCT_MCWDT_CNTHIGH_WDT_CTR2_Msk (0xffffffffUL)  /*!< MCWDT_STRUCT MCWDT_CNTHIGH: WDT_CTR2 (Bitfield-Mask: 0xffffffff)*/
/* ===============================================  MCWDT_STRUCT.MCWDT_MATCH  ================================================ */
#define MCWDT_STRUCT_MCWDT_MATCH_WDT_MATCH0_Pos (0UL)           /*!< MCWDT_STRUCT MCWDT_MATCH: WDT_MATCH0 (Bit 0)              */
#define MCWDT_STRUCT_MCWDT_MATCH_WDT_MATCH0_Msk (0xffffUL)      /*!< MCWDT_STRUCT MCWDT_MATCH: WDT_MATCH0 (Bitfield-Mask: 0xffff)*/
#define MCWDT_STRUCT_MCWDT_MATCH_WDT_MATCH1_Pos (16UL)          /*!< MCWDT_STRUCT MCWDT_MATCH: WDT_MATCH1 (Bit 16)             */
#define MCWDT_STRUCT_MCWDT_MATCH_WDT_MATCH1_Msk (0xffff0000UL)  /*!< MCWDT_STRUCT MCWDT_MATCH: WDT_MATCH1 (Bitfield-Mask: 0xffff)*/
/* ===============================================  MCWDT_STRUCT.MCWDT_CONFIG  =============================================== */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE0_Pos (0UL)           /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE0 (Bit 0)              */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE0_Msk (0x3UL)         /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE0 (Bitfield-Mask: 0x03)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CLEAR0_Pos (2UL)          /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CLEAR0 (Bit 2)             */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CLEAR0_Msk (0x4UL)        /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CLEAR0 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CASCADE0_1_Pos (3UL)      /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CASCADE0_1 (Bit 3)         */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CASCADE0_1_Msk (0x8UL)    /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CASCADE0_1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE1_Pos (8UL)           /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE1 (Bit 8)              */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE1_Msk (0x300UL)       /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE1 (Bitfield-Mask: 0x03)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CLEAR1_Pos (10UL)         /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CLEAR1 (Bit 10)            */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CLEAR1_Msk (0x400UL)      /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CLEAR1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CASCADE1_2_Pos (11UL)     /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CASCADE1_2 (Bit 11)        */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_CASCADE1_2_Msk (0x800UL)  /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_CASCADE1_2 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE2_Pos (16UL)          /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE2 (Bit 16)             */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_MODE2_Msk (0x10000UL)     /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_MODE2 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_BITS2_Pos (24UL)          /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_BITS2 (Bit 24)             */
#define MCWDT_STRUCT_MCWDT_CONFIG_WDT_BITS2_Msk (0x1f000000UL)  /*!< MCWDT_STRUCT MCWDT_CONFIG: WDT_BITS2 (Bitfield-Mask: 0x1f)*/
/* ================================================  MCWDT_STRUCT.MCWDT_CTL  ================================================= */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE0_Pos (0UL)            /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE0 (Bit 0)               */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE0_Msk (0x1UL)          /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE0 (Bitfield-Mask: 0x01) */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED0_Pos (1UL)           /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED0 (Bit 1)              */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED0_Msk (0x2UL)         /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED0 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET0_Pos (3UL)             /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET0 (Bit 3)                */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET0_Msk (0x8UL)           /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET0 (Bitfield-Mask: 0x01)  */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE1_Pos (8UL)            /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE1 (Bit 8)               */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE1_Msk (0x100UL)        /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE1 (Bitfield-Mask: 0x01) */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED1_Pos (9UL)           /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED1 (Bit 9)              */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED1_Msk (0x200UL)       /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET1_Pos (11UL)            /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET1 (Bit 11)               */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET1_Msk (0x800UL)         /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET1 (Bitfield-Mask: 0x01)  */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE2_Pos (16UL)           /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE2 (Bit 16)              */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLE2_Msk (0x10000UL)      /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLE2 (Bitfield-Mask: 0x01) */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED2_Pos (17UL)          /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED2 (Bit 17)             */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_ENABLED2_Msk (0x20000UL)     /*!< MCWDT_STRUCT MCWDT_CTL: WDT_ENABLED2 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET2_Pos (19UL)            /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET2 (Bit 19)               */
#define MCWDT_STRUCT_MCWDT_CTL_WDT_RESET2_Msk (0x80000UL)       /*!< MCWDT_STRUCT MCWDT_CTL: WDT_RESET2 (Bitfield-Mask: 0x01)  */
/* ================================================  MCWDT_STRUCT.MCWDT_INTR  ================================================ */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT0_Pos (0UL)            /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT0 (Bit 0)               */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT0_Msk (0x1UL)          /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT0 (Bitfield-Mask: 0x01) */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT1_Pos (1UL)            /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT1 (Bit 1)               */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT1_Msk (0x2UL)          /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT1 (Bitfield-Mask: 0x01) */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT2_Pos (2UL)            /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT2 (Bit 2)               */
#define MCWDT_STRUCT_MCWDT_INTR_MCWDT_INT2_Msk (0x4UL)          /*!< MCWDT_STRUCT MCWDT_INTR: MCWDT_INT2 (Bitfield-Mask: 0x01) */
/* ==============================================  MCWDT_STRUCT.MCWDT_INTR_SET  ============================================== */
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT0_Pos (0UL)        /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT0 (Bit 0)           */
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT0_Msk (0x1UL)      /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT0 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT1_Pos (1UL)        /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT1 (Bit 1)           */
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT1_Msk (0x2UL)      /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT2_Pos (2UL)        /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT2 (Bit 2)           */
#define MCWDT_STRUCT_MCWDT_INTR_SET_MCWDT_INT2_Msk (0x4UL)      /*!< MCWDT_STRUCT MCWDT_INTR_SET: MCWDT_INT2 (Bitfield-Mask: 0x01)*/
/* =============================================  MCWDT_STRUCT.MCWDT_INTR_MASK  ============================================== */
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT0_Pos (0UL)       /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT0 (Bit 0)          */
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT0_Msk (0x1UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT0 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT1_Pos (1UL)       /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT1 (Bit 1)          */
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT1_Msk (0x2UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT2_Pos (2UL)       /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT2 (Bit 2)          */
#define MCWDT_STRUCT_MCWDT_INTR_MASK_MCWDT_INT2_Msk (0x4UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASK: MCWDT_INT2 (Bitfield-Mask: 0x01)*/
/* ============================================  MCWDT_STRUCT.MCWDT_INTR_MASKED  ============================================= */
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT0_Pos (0UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT0 (Bit 0)        */
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT0_Msk (0x1UL)   /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT0 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT1_Pos (1UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT1 (Bit 1)        */
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT1_Msk (0x2UL)   /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT1 (Bitfield-Mask: 0x01)*/
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT2_Pos (2UL)     /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT2 (Bit 2)        */
#define MCWDT_STRUCT_MCWDT_INTR_MASKED_MCWDT_INT2_Msk (0x4UL)   /*!< MCWDT_STRUCT MCWDT_INTR_MASKED: MCWDT_INT2 (Bitfield-Mask: 0x01)*/
/* ================================================  MCWDT_STRUCT.MCWDT_LOCK  ================================================ */
#define MCWDT_STRUCT_MCWDT_LOCK_MCWDT_LOCK_Pos (30UL)           /*!< MCWDT_STRUCT MCWDT_LOCK: MCWDT_LOCK (Bit 30)              */
#define MCWDT_STRUCT_MCWDT_LOCK_MCWDT_LOCK_Msk (0xc0000000UL)   /*!< MCWDT_STRUCT MCWDT_LOCK: MCWDT_LOCK (Bitfield-Mask: 0x03) */


