ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_srss.h
/* ====================================================  CLK_CSV.HF_CTL  ===================================================== */
#define CLK_CSV_HF_CTL_CSV_FREQ_WINDOW_Pos (0UL)                /*!< CLK_CSV HF_CTL: CSV_FREQ_WINDOW (Bit 0)                   */
#define CLK_CSV_HF_CTL_CSV_FREQ_WINDOW_Msk (0xffffUL)           /*!< CLK_CSV HF_CTL: CSV_FREQ_WINDOW (Bitfield-Mask: 0xffff)   */
#define CLK_CSV_HF_CTL_CSV_MUX_Pos        (16UL)                /*!< CLK_CSV HF_CTL: CSV_MUX (Bit 16)                          */
#define CLK_CSV_HF_CTL_CSV_MUX_Msk        (0x30000UL)           /*!< CLK_CSV HF_CTL: CSV_MUX (Bitfield-Mask: 0x03)             */
#define CLK_CSV_HF_CTL_CSV_LOSS_WINDOW_Pos (20UL)               /*!< CLK_CSV HF_CTL: CSV_LOSS_WINDOW (Bit 20)                  */
#define CLK_CSV_HF_CTL_CSV_LOSS_WINDOW_Msk (0x700000UL)         /*!< CLK_CSV HF_CTL: CSV_LOSS_WINDOW (Bitfield-Mask: 0x07)     */
#define CLK_CSV_HF_CTL_CSV_FREQ_ACTION_Pos (24UL)               /*!< CLK_CSV HF_CTL: CSV_FREQ_ACTION (Bit 24)                  */
#define CLK_CSV_HF_CTL_CSV_FREQ_ACTION_Msk (0x3000000UL)        /*!< CLK_CSV HF_CTL: CSV_FREQ_ACTION (Bitfield-Mask: 0x03)     */
#define CLK_CSV_HF_CTL_CSV_FREQ_ONESHOT_Pos (26UL)              /*!< CLK_CSV HF_CTL: CSV_FREQ_ONESHOT (Bit 26)                 */
#define CLK_CSV_HF_CTL_CSV_FREQ_ONESHOT_Msk (0x4000000UL)       /*!< CLK_CSV HF_CTL: CSV_FREQ_ONESHOT (Bitfield-Mask: 0x01)    */
#define CLK_CSV_HF_CTL_CSV_FREQ_EN_Pos    (27UL)                /*!< CLK_CSV HF_CTL: CSV_FREQ_EN (Bit 27)                      */
#define CLK_CSV_HF_CTL_CSV_FREQ_EN_Msk    (0x8000000UL)         /*!< CLK_CSV HF_CTL: CSV_FREQ_EN (Bitfield-Mask: 0x01)         */
#define CLK_CSV_HF_CTL_CSV_LOSS_ACTION_Pos (28UL)               /*!< CLK_CSV HF_CTL: CSV_LOSS_ACTION (Bit 28)                  */
#define CLK_CSV_HF_CTL_CSV_LOSS_ACTION_Msk (0x30000000UL)       /*!< CLK_CSV HF_CTL: CSV_LOSS_ACTION (Bitfield-Mask: 0x03)     */
#define CLK_CSV_HF_CTL_CSV_LOSS_EN_Pos    (31UL)                /*!< CLK_CSV HF_CTL: CSV_LOSS_EN (Bit 31)                      */
#define CLK_CSV_HF_CTL_CSV_LOSS_EN_Msk    (0x80000000UL)        /*!< CLK_CSV HF_CTL: CSV_LOSS_EN (Bitfield-Mask: 0x01)         */
/* ===================================================  CLK_CSV.HF_LIMIT  ==================================================== */
#define CLK_CSV_HF_LIMIT_LOWER_LIMIT_Pos  (0UL)                 /*!< CLK_CSV HF_LIMIT: LOWER_LIMIT (Bit 0)                     */
#define CLK_CSV_HF_LIMIT_LOWER_LIMIT_Msk  (0xffffUL)            /*!< CLK_CSV HF_LIMIT: LOWER_LIMIT (Bitfield-Mask: 0xffff)     */
#define CLK_CSV_HF_LIMIT_UPPER_LIMIT_Pos  (16UL)                /*!< CLK_CSV HF_LIMIT: UPPER_LIMIT (Bit 16)                    */
#define CLK_CSV_HF_LIMIT_UPPER_LIMIT_Msk  (0xffff0000UL)        /*!< CLK_CSV HF_LIMIT: UPPER_LIMIT (Bitfield-Mask: 0xffff)     */
/* ====================================================  CLK_CSV.HF_CNT  ===================================================== */
#define CLK_CSV_HF_CNT_CNT_Pos            (0UL)                 /*!< CLK_CSV HF_CNT: CNT (Bit 0)                               */
#define CLK_CSV_HF_CNT_CNT_Msk            (0xffffUL)            /*!< CLK_CSV HF_CNT: CNT (Bitfield-Mask: 0xffff)               */


/* =====================================================  SRSS.PWR_CTL  ====================================================== */
#define SRSS_PWR_CTL_POWER_MODE_Pos       (0UL)                 /*!< SRSS PWR_CTL: POWER_MODE (Bit 0)                          */
#define SRSS_PWR_CTL_POWER_MODE_Msk       (0x3UL)               /*!< SRSS PWR_CTL: POWER_MODE (Bitfield-Mask: 0x03)            */
#define SRSS_PWR_CTL_DEBUG_SESSION_Pos    (4UL)                 /*!< SRSS PWR_CTL: DEBUG_SESSION (Bit 4)                       */
#define SRSS_PWR_CTL_DEBUG_SESSION_Msk    (0x10UL)              /*!< SRSS PWR_CTL: DEBUG_SESSION (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_LPM_READY_Pos        (5UL)                 /*!< SRSS PWR_CTL: LPM_READY (Bit 5)                           */
#define SRSS_PWR_CTL_LPM_READY_Msk        (0x20UL)              /*!< SRSS PWR_CTL: LPM_READY (Bitfield-Mask: 0x01)             */
#define SRSS_PWR_CTL_DPSLP_REG_DIS_Pos    (20UL)                /*!< SRSS PWR_CTL: DPSLP_REG_DIS (Bit 20)                      */
#define SRSS_PWR_CTL_DPSLP_REG_DIS_Msk    (0x100000UL)          /*!< SRSS PWR_CTL: DPSLP_REG_DIS (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_RET_REG_DIS_Pos      (21UL)                /*!< SRSS PWR_CTL: RET_REG_DIS (Bit 21)                        */
#define SRSS_PWR_CTL_RET_REG_DIS_Msk      (0x200000UL)          /*!< SRSS PWR_CTL: RET_REG_DIS (Bitfield-Mask: 0x01)           */
#define SRSS_PWR_CTL_NWELL_REG_DIS_Pos    (22UL)                /*!< SRSS PWR_CTL: NWELL_REG_DIS (Bit 22)                      */
#define SRSS_PWR_CTL_NWELL_REG_DIS_Msk    (0x400000UL)          /*!< SRSS PWR_CTL: NWELL_REG_DIS (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_LINREG_DIS_Pos       (23UL)                /*!< SRSS PWR_CTL: LINREG_DIS (Bit 23)                         */
#define SRSS_PWR_CTL_LINREG_DIS_Msk       (0x800000UL)          /*!< SRSS PWR_CTL: LINREG_DIS (Bitfield-Mask: 0x01)            */
#define SRSS_PWR_CTL_LINREG_LPMODE_Pos    (24UL)                /*!< SRSS PWR_CTL: LINREG_LPMODE (Bit 24)                      */
#define SRSS_PWR_CTL_LINREG_LPMODE_Msk    (0x1000000UL)         /*!< SRSS PWR_CTL: LINREG_LPMODE (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_PORBOD_LPMODE_Pos    (25UL)                /*!< SRSS PWR_CTL: PORBOD_LPMODE (Bit 25)                      */
#define SRSS_PWR_CTL_PORBOD_LPMODE_Msk    (0x2000000UL)         /*!< SRSS PWR_CTL: PORBOD_LPMODE (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_BGREF_LPMODE_Pos     (26UL)                /*!< SRSS PWR_CTL: BGREF_LPMODE (Bit 26)                       */
#define SRSS_PWR_CTL_BGREF_LPMODE_Msk     (0x4000000UL)         /*!< SRSS PWR_CTL: BGREF_LPMODE (Bitfield-Mask: 0x01)          */
#define SRSS_PWR_CTL_PLL_LS_BYPASS_Pos    (27UL)                /*!< SRSS PWR_CTL: PLL_LS_BYPASS (Bit 27)                      */
#define SRSS_PWR_CTL_PLL_LS_BYPASS_Msk    (0x8000000UL)         /*!< SRSS PWR_CTL: PLL_LS_BYPASS (Bitfield-Mask: 0x01)         */
#define SRSS_PWR_CTL_VREFBUF_LPMODE_Pos   (28UL)                /*!< SRSS PWR_CTL: VREFBUF_LPMODE (Bit 28)                     */
#define SRSS_PWR_CTL_VREFBUF_LPMODE_Msk   (0x10000000UL)        /*!< SRSS PWR_CTL: VREFBUF_LPMODE (Bitfield-Mask: 0x01)        */
#define SRSS_PWR_CTL_VREFBUF_DIS_Pos      (29UL)                /*!< SRSS PWR_CTL: VREFBUF_DIS (Bit 29)                        */
#define SRSS_PWR_CTL_VREFBUF_DIS_Msk      (0x20000000UL)        /*!< SRSS PWR_CTL: VREFBUF_DIS (Bitfield-Mask: 0x01)           */
#define SRSS_PWR_CTL_ACT_REF_DIS_Pos      (30UL)                /*!< SRSS PWR_CTL: ACT_REF_DIS (Bit 30)                        */
#define SRSS_PWR_CTL_ACT_REF_DIS_Msk      (0x40000000UL)        /*!< SRSS PWR_CTL: ACT_REF_DIS (Bitfield-Mask: 0x01)           */
#define SRSS_PWR_CTL_ACT_REF_OK_Pos       (31UL)                /*!< SRSS PWR_CTL: ACT_REF_OK (Bit 31)                         */
#define SRSS_PWR_CTL_ACT_REF_OK_Msk       (0x80000000UL)        /*!< SRSS PWR_CTL: ACT_REF_OK (Bitfield-Mask: 0x01)            */
/* ==================================================  SRSS.PWR_HIBERNATE  =================================================== */
#define SRSS_PWR_HIBERNATE_TOKEN_Pos      (0UL)                 /*!< SRSS PWR_HIBERNATE: TOKEN (Bit 0)                         */
#define SRSS_PWR_HIBERNATE_TOKEN_Msk      (0xffUL)              /*!< SRSS PWR_HIBERNATE: TOKEN (Bitfield-Mask: 0xff)           */
#define SRSS_PWR_HIBERNATE_UNLOCK_Pos     (8UL)                 /*!< SRSS PWR_HIBERNATE: UNLOCK (Bit 8)                        */
#define SRSS_PWR_HIBERNATE_UNLOCK_Msk     (0xff00UL)            /*!< SRSS PWR_HIBERNATE: UNLOCK (Bitfield-Mask: 0xff)          */
#define SRSS_PWR_HIBERNATE_FREEZE_Pos     (17UL)                /*!< SRSS PWR_HIBERNATE: FREEZE (Bit 17)                       */
#define SRSS_PWR_HIBERNATE_FREEZE_Msk     (0x20000UL)           /*!< SRSS PWR_HIBERNATE: FREEZE (Bitfield-Mask: 0x01)          */
#define SRSS_PWR_HIBERNATE_MASK_HIBALARM_Pos (18UL)             /*!< SRSS PWR_HIBERNATE: MASK_HIBALARM (Bit 18)                */
#define SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk (0x40000UL)        /*!< SRSS PWR_HIBERNATE: MASK_HIBALARM (Bitfield-Mask: 0x01)   */
#define SRSS_PWR_HIBERNATE_MASK_HIBWDT_Pos (19UL)               /*!< SRSS PWR_HIBERNATE: MASK_HIBWDT (Bit 19)                  */
#define SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk (0x80000UL)          /*!< SRSS PWR_HIBERNATE: MASK_HIBWDT (Bitfield-Mask: 0x01)     */
#define SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Pos (20UL)           /*!< SRSS PWR_HIBERNATE: POLARITY_HIBPIN (Bit 20)              */
#define SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk (0xf00000UL)     /*!< SRSS PWR_HIBERNATE: POLARITY_HIBPIN (Bitfield-Mask: 0x0f) */
#define SRSS_PWR_HIBERNATE_MASK_HIBPIN_Pos (24UL)               /*!< SRSS PWR_HIBERNATE: MASK_HIBPIN (Bit 24)                  */
#define SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk (0xf000000UL)        /*!< SRSS PWR_HIBERNATE: MASK_HIBPIN (Bitfield-Mask: 0x0f)     */
#define SRSS_PWR_HIBERNATE_HIBERNATE_DISABLE_Pos (30UL)         /*!< SRSS PWR_HIBERNATE: HIBERNATE_DISABLE (Bit 30)            */
#define SRSS_PWR_HIBERNATE_HIBERNATE_DISABLE_Msk (0x40000000UL) /*!< SRSS PWR_HIBERNATE: HIBERNATE_DISABLE (Bitfield-Mask: 0x01)*/
#define SRSS_PWR_HIBERNATE_HIBERNATE_Pos  (31UL)                /*!< SRSS PWR_HIBERNATE: HIBERNATE (Bit 31)                    */
#define SRSS_PWR_HIBERNATE_HIBERNATE_Msk  (0x80000000UL)        /*!< SRSS PWR_HIBERNATE: HIBERNATE (Bitfield-Mask: 0x01)       */
/* ===================================================  SRSS.PWR_LVD_CTL  ==================================================== */
#define SRSS_PWR_LVD_CTL_HVLVD1_TRIPSEL_Pos (0UL)               /*!< SRSS PWR_LVD_CTL: HVLVD1_TRIPSEL (Bit 0)                  */
#define SRSS_PWR_LVD_CTL_HVLVD1_TRIPSEL_Msk (0xfUL)             /*!< SRSS PWR_LVD_CTL: HVLVD1_TRIPSEL (Bitfield-Mask: 0x0f)    */
#define SRSS_PWR_LVD_CTL_HVLVD1_SRCSEL_Pos (4UL)                /*!< SRSS PWR_LVD_CTL: HVLVD1_SRCSEL (Bit 4)                   */
#define SRSS_PWR_LVD_CTL_HVLVD1_SRCSEL_Msk (0x70UL)             /*!< SRSS PWR_LVD_CTL: HVLVD1_SRCSEL (Bitfield-Mask: 0x07)     */
#define SRSS_PWR_LVD_CTL_HVLVD1_EN_Pos    (7UL)                 /*!< SRSS PWR_LVD_CTL: HVLVD1_EN (Bit 7)                       */
#define SRSS_PWR_LVD_CTL_HVLVD1_EN_Msk    (0x80UL)              /*!< SRSS PWR_LVD_CTL: HVLVD1_EN (Bitfield-Mask: 0x01)         */
/* ===================================================  SRSS.PWR_BUCK_CTL  =================================================== */
#define SRSS_PWR_BUCK_CTL_BUCK_OUT1_SEL_Pos (0UL)               /*!< SRSS PWR_BUCK_CTL: BUCK_OUT1_SEL (Bit 0)                  */
#define SRSS_PWR_BUCK_CTL_BUCK_OUT1_SEL_Msk (0x7UL)             /*!< SRSS PWR_BUCK_CTL: BUCK_OUT1_SEL (Bitfield-Mask: 0x07)    */
#define SRSS_PWR_BUCK_CTL_BUCK_EN_Pos     (30UL)                /*!< SRSS PWR_BUCK_CTL: BUCK_EN (Bit 30)                       */
#define SRSS_PWR_BUCK_CTL_BUCK_EN_Msk     (0x40000000UL)        /*!< SRSS PWR_BUCK_CTL: BUCK_EN (Bitfield-Mask: 0x01)          */
#define SRSS_PWR_BUCK_CTL_BUCK_OUT1_EN_Pos (31UL)               /*!< SRSS PWR_BUCK_CTL: BUCK_OUT1_EN (Bit 31)                  */
#define SRSS_PWR_BUCK_CTL_BUCK_OUT1_EN_Msk (0x80000000UL)       /*!< SRSS PWR_BUCK_CTL: BUCK_OUT1_EN (Bitfield-Mask: 0x01)     */
/* ==================================================  SRSS.PWR_BUCK_CTL2  =================================================== */
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_SEL_Pos (0UL)              /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_SEL (Bit 0)                 */
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_SEL_Msk (0x7UL)            /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_SEL (Bitfield-Mask: 0x07)   */
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL_Pos (30UL)          /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_HW_SEL (Bit 30)             */
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL_Msk (0x40000000UL)  /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_HW_SEL (Bitfield-Mask: 0x01)*/
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_EN_Pos (31UL)              /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_EN (Bit 31)                 */
#define SRSS_PWR_BUCK_CTL2_BUCK_OUT2_EN_Msk (0x80000000UL)      /*!< SRSS PWR_BUCK_CTL2: BUCK_OUT2_EN (Bitfield-Mask: 0x01)    */
/* ==================================================  SRSS.PWR_LVD_STATUS  ================================================== */
#define SRSS_PWR_LVD_STATUS_HVLVD1_OK_Pos (0UL)                 /*!< SRSS PWR_LVD_STATUS: HVLVD1_OK (Bit 0)                    */
#define SRSS_PWR_LVD_STATUS_HVLVD1_OK_Msk (0x1UL)               /*!< SRSS PWR_LVD_STATUS: HVLVD1_OK (Bitfield-Mask: 0x01)      */
/* ===================================================  SRSS.PWR_HIB_DATA  =================================================== */
#define SRSS_PWR_HIB_DATA_HIB_DATA_Pos    (0UL)                 /*!< SRSS PWR_HIB_DATA: HIB_DATA (Bit 0)                       */
#define SRSS_PWR_HIB_DATA_HIB_DATA_Msk    (0xffffffffUL)        /*!< SRSS PWR_HIB_DATA: HIB_DATA (Bitfield-Mask: 0xffffffff)   */
/* =====================================================  SRSS.WDT_CTL  ====================================================== */
#define SRSS_WDT_CTL_WDT_EN_Pos           (0UL)                 /*!< SRSS WDT_CTL: WDT_EN (Bit 0)                              */
#define SRSS_WDT_CTL_WDT_EN_Msk           (0x1UL)               /*!< SRSS WDT_CTL: WDT_EN (Bitfield-Mask: 0x01)                */
#define SRSS_WDT_CTL_WDT_LOCK_Pos         (30UL)                /*!< SRSS WDT_CTL: WDT_LOCK (Bit 30)                           */
#define SRSS_WDT_CTL_WDT_LOCK_Msk         (0xc0000000UL)        /*!< SRSS WDT_CTL: WDT_LOCK (Bitfield-Mask: 0x03)              */
/* =====================================================  SRSS.WDT_CNT  ====================================================== */
#define SRSS_WDT_CNT_COUNTER_Pos          (0UL)                 /*!< SRSS WDT_CNT: COUNTER (Bit 0)                             */
#define SRSS_WDT_CNT_COUNTER_Msk          (0xffffUL)            /*!< SRSS WDT_CNT: COUNTER (Bitfield-Mask: 0xffff)             */
/* ====================================================  SRSS.WDT_MATCH  ===================================================== */
#define SRSS_WDT_MATCH_MATCH_Pos          (0UL)                 /*!< SRSS WDT_MATCH: MATCH (Bit 0)                             */
#define SRSS_WDT_MATCH_MATCH_Msk          (0xffffUL)            /*!< SRSS WDT_MATCH: MATCH (Bitfield-Mask: 0xffff)             */
#define SRSS_WDT_MATCH_IGNORE_BITS_Pos    (16UL)                /*!< SRSS WDT_MATCH: IGNORE_BITS (Bit 16)                      */
#define SRSS_WDT_MATCH_IGNORE_BITS_Msk    (0xf0000UL)           /*!< SRSS WDT_MATCH: IGNORE_BITS (Bitfield-Mask: 0x0f)         */
/* ==================================================  SRSS.CLK_DSI_SELECT  ================================================== */
#define SRSS_CLK_DSI_SELECT_DSI_MUX_Pos   (0UL)                 /*!< SRSS CLK_DSI_SELECT: DSI_MUX (Bit 0)                      */
#define SRSS_CLK_DSI_SELECT_DSI_MUX_Msk   (0x1fUL)              /*!< SRSS CLK_DSI_SELECT: DSI_MUX (Bitfield-Mask: 0x1f)        */
/* =================================================  SRSS.CLK_PATH_SELECT  ================================================== */
#define SRSS_CLK_PATH_SELECT_PATH_MUX_Pos (0UL)                 /*!< SRSS CLK_PATH_SELECT: PATH_MUX (Bit 0)                    */
#define SRSS_CLK_PATH_SELECT_PATH_MUX_Msk (0x7UL)               /*!< SRSS CLK_PATH_SELECT: PATH_MUX (Bitfield-Mask: 0x07)      */
/* =================================================  SRSS.CLK_ROOT_SELECT  ================================================== */
#define SRSS_CLK_ROOT_SELECT_ROOT_MUX_Pos (0UL)                 /*!< SRSS CLK_ROOT_SELECT: ROOT_MUX (Bit 0)                    */
#define SRSS_CLK_ROOT_SELECT_ROOT_MUX_Msk (0xfUL)               /*!< SRSS CLK_ROOT_SELECT: ROOT_MUX (Bitfield-Mask: 0x0f)      */
#define SRSS_CLK_ROOT_SELECT_ROOT_DIV_Pos (4UL)                 /*!< SRSS CLK_ROOT_SELECT: ROOT_DIV (Bit 4)                    */
#define SRSS_CLK_ROOT_SELECT_ROOT_DIV_Msk (0x30UL)              /*!< SRSS CLK_ROOT_SELECT: ROOT_DIV (Bitfield-Mask: 0x03)      */
#define SRSS_CLK_ROOT_SELECT_ENABLE_Pos   (31UL)                /*!< SRSS CLK_ROOT_SELECT: ENABLE (Bit 31)                     */
#define SRSS_CLK_ROOT_SELECT_ENABLE_Msk   (0x80000000UL)        /*!< SRSS CLK_ROOT_SELECT: ENABLE (Bitfield-Mask: 0x01)        */
/* ====================================================  SRSS.CLK_SELECT  ==================================================== */
#define SRSS_CLK_SELECT_LFCLK_SEL_Pos     (0UL)                 /*!< SRSS CLK_SELECT: LFCLK_SEL (Bit 0)                        */
#define SRSS_CLK_SELECT_LFCLK_SEL_Msk     (0x3UL)               /*!< SRSS CLK_SELECT: LFCLK_SEL (Bitfield-Mask: 0x03)          */
#define SRSS_CLK_SELECT_PUMP_SEL_Pos      (8UL)                 /*!< SRSS CLK_SELECT: PUMP_SEL (Bit 8)                         */
#define SRSS_CLK_SELECT_PUMP_SEL_Msk      (0xf00UL)             /*!< SRSS CLK_SELECT: PUMP_SEL (Bitfield-Mask: 0x0f)           */
#define SRSS_CLK_SELECT_PUMP_DIV_Pos      (12UL)                /*!< SRSS CLK_SELECT: PUMP_DIV (Bit 12)                        */
#define SRSS_CLK_SELECT_PUMP_DIV_Msk      (0x7000UL)            /*!< SRSS CLK_SELECT: PUMP_DIV (Bitfield-Mask: 0x07)           */
#define SRSS_CLK_SELECT_PUMP_ENABLE_Pos   (15UL)                /*!< SRSS CLK_SELECT: PUMP_ENABLE (Bit 15)                     */
#define SRSS_CLK_SELECT_PUMP_ENABLE_Msk   (0x8000UL)            /*!< SRSS CLK_SELECT: PUMP_ENABLE (Bitfield-Mask: 0x01)        */
/* ==================================================  SRSS.CLK_TIMER_CTL  =================================================== */
#define SRSS_CLK_TIMER_CTL_TIMER_SEL_Pos  (0UL)                 /*!< SRSS CLK_TIMER_CTL: TIMER_SEL (Bit 0)                     */
#define SRSS_CLK_TIMER_CTL_TIMER_SEL_Msk  (0x1UL)               /*!< SRSS CLK_TIMER_CTL: TIMER_SEL (Bitfield-Mask: 0x01)       */
#define SRSS_CLK_TIMER_CTL_TIMER_HF0_DIV_Pos (8UL)              /*!< SRSS CLK_TIMER_CTL: TIMER_HF0_DIV (Bit 8)                 */
#define SRSS_CLK_TIMER_CTL_TIMER_HF0_DIV_Msk (0x300UL)          /*!< SRSS CLK_TIMER_CTL: TIMER_HF0_DIV (Bitfield-Mask: 0x03)   */
#define SRSS_CLK_TIMER_CTL_TIMER_DIV_Pos  (16UL)                /*!< SRSS CLK_TIMER_CTL: TIMER_DIV (Bit 16)                    */
#define SRSS_CLK_TIMER_CTL_TIMER_DIV_Msk  (0xff0000UL)          /*!< SRSS CLK_TIMER_CTL: TIMER_DIV (Bitfield-Mask: 0xff)       */
#define SRSS_CLK_TIMER_CTL_ENABLE_Pos     (31UL)                /*!< SRSS CLK_TIMER_CTL: ENABLE (Bit 31)                       */
#define SRSS_CLK_TIMER_CTL_ENABLE_Msk     (0x80000000UL)        /*!< SRSS CLK_TIMER_CTL: ENABLE (Bitfield-Mask: 0x01)          */
/* =================================================  SRSS.CLK_CSV_WCO_CTL  ================================================== */
#define SRSS_CLK_CSV_WCO_CTL_CSV_MUX_Pos  (16UL)                /*!< SRSS CLK_CSV_WCO_CTL: CSV_MUX (Bit 16)                    */
#define SRSS_CLK_CSV_WCO_CTL_CSV_MUX_Msk  (0x30000UL)           /*!< SRSS CLK_CSV_WCO_CTL: CSV_MUX (Bitfield-Mask: 0x03)       */
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_WINDOW_Pos (20UL)         /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_WINDOW (Bit 20)            */
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_WINDOW_Msk (0x700000UL)   /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_WINDOW (Bitfield-Mask: 0x07)*/
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_ACTION_Pos (28UL)         /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_ACTION (Bit 28)            */
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_ACTION_Msk (0x30000000UL) /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_ACTION (Bitfield-Mask: 0x03)*/
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_EN_Pos (31UL)             /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_EN (Bit 31)                */
#define SRSS_CLK_CSV_WCO_CTL_CSV_LOSS_EN_Msk (0x80000000UL)     /*!< SRSS CLK_CSV_WCO_CTL: CSV_LOSS_EN (Bitfield-Mask: 0x01)   */
/* ==================================================  SRSS.CLK_ILO_CONFIG  ================================================== */
#define SRSS_CLK_ILO_CONFIG_HVILO_BACKUP_Pos (0UL)              /*!< SRSS CLK_ILO_CONFIG: HVILO_BACKUP (Bit 0)                 */
#define SRSS_CLK_ILO_CONFIG_HVILO_BACKUP_Msk (0x1UL)            /*!< SRSS CLK_ILO_CONFIG: HVILO_BACKUP (Bitfield-Mask: 0x01)   */
#define SRSS_CLK_ILO_CONFIG_ENABLE_Pos    (31UL)                /*!< SRSS CLK_ILO_CONFIG: ENABLE (Bit 31)                      */
#define SRSS_CLK_ILO_CONFIG_ENABLE_Msk    (0x80000000UL)        /*!< SRSS CLK_ILO_CONFIG: ENABLE (Bitfield-Mask: 0x01)         */
/* ==================================================  SRSS.CLK_IMO_CONFIG  ================================================== */
#define SRSS_CLK_IMO_CONFIG_ENABLE_Pos    (31UL)                /*!< SRSS CLK_IMO_CONFIG: ENABLE (Bit 31)                      */
#define SRSS_CLK_IMO_CONFIG_ENABLE_Msk    (0x80000000UL)        /*!< SRSS CLK_IMO_CONFIG: ENABLE (Bitfield-Mask: 0x01)         */
/* =================================================  SRSS.CLK_OUTPUT_FAST  ================================================== */
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL0_Pos (0UL)                /*!< SRSS CLK_OUTPUT_FAST: FAST_SEL0 (Bit 0)                   */
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL0_Msk (0xfUL)              /*!< SRSS CLK_OUTPUT_FAST: FAST_SEL0 (Bitfield-Mask: 0x0f)     */
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL0_Pos (4UL)                /*!< SRSS CLK_OUTPUT_FAST: PATH_SEL0 (Bit 4)                   */
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL0_Msk (0xf0UL)             /*!< SRSS CLK_OUTPUT_FAST: PATH_SEL0 (Bitfield-Mask: 0x0f)     */
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL0_Pos (8UL)               /*!< SRSS CLK_OUTPUT_FAST: HFCLK_SEL0 (Bit 8)                  */
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL0_Msk (0xf00UL)           /*!< SRSS CLK_OUTPUT_FAST: HFCLK_SEL0 (Bitfield-Mask: 0x0f)    */
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL1_Pos (16UL)               /*!< SRSS CLK_OUTPUT_FAST: FAST_SEL1 (Bit 16)                  */
#define SRSS_CLK_OUTPUT_FAST_FAST_SEL1_Msk (0xf0000UL)          /*!< SRSS CLK_OUTPUT_FAST: FAST_SEL1 (Bitfield-Mask: 0x0f)     */
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL1_Pos (20UL)               /*!< SRSS CLK_OUTPUT_FAST: PATH_SEL1 (Bit 20)                  */
#define SRSS_CLK_OUTPUT_FAST_PATH_SEL1_Msk (0xf00000UL)         /*!< SRSS CLK_OUTPUT_FAST: PATH_SEL1 (Bitfield-Mask: 0x0f)     */
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL1_Pos (24UL)              /*!< SRSS CLK_OUTPUT_FAST: HFCLK_SEL1 (Bit 24)                 */
#define SRSS_CLK_OUTPUT_FAST_HFCLK_SEL1_Msk (0xf000000UL)       /*!< SRSS CLK_OUTPUT_FAST: HFCLK_SEL1 (Bitfield-Mask: 0x0f)    */
/* =================================================  SRSS.CLK_OUTPUT_SLOW  ================================================== */
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL0_Pos (0UL)                /*!< SRSS CLK_OUTPUT_SLOW: SLOW_SEL0 (Bit 0)                   */
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL0_Msk (0xfUL)              /*!< SRSS CLK_OUTPUT_SLOW: SLOW_SEL0 (Bitfield-Mask: 0x0f)     */
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL1_Pos (4UL)                /*!< SRSS CLK_OUTPUT_SLOW: SLOW_SEL1 (Bit 4)                   */
#define SRSS_CLK_OUTPUT_SLOW_SLOW_SEL1_Msk (0xf0UL)             /*!< SRSS CLK_OUTPUT_SLOW: SLOW_SEL1 (Bitfield-Mask: 0x0f)     */
/* ===================================================  SRSS.CLK_CAL_CNT1  =================================================== */
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER1_Pos (0UL)                /*!< SRSS CLK_CAL_CNT1: CAL_COUNTER1 (Bit 0)                   */
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER1_Msk (0xffffffUL)         /*!< SRSS CLK_CAL_CNT1: CAL_COUNTER1 (Bitfield-Mask: 0xffffff) */
