ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_srss.h
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE_Pos (31UL)           /*!< SRSS CLK_CAL_CNT1: CAL_COUNTER_DONE (Bit 31)              */
#define SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE_Msk (0x80000000UL)   /*!< SRSS CLK_CAL_CNT1: CAL_COUNTER_DONE (Bitfield-Mask: 0x01) */
/* ===================================================  SRSS.CLK_CAL_CNT2  =================================================== */
#define SRSS_CLK_CAL_CNT2_CAL_COUNTER2_Pos (0UL)                /*!< SRSS CLK_CAL_CNT2: CAL_COUNTER2 (Bit 0)                   */
#define SRSS_CLK_CAL_CNT2_CAL_COUNTER2_Msk (0xffffffUL)         /*!< SRSS CLK_CAL_CNT2: CAL_COUNTER2 (Bitfield-Mask: 0xffffff) */
/* ==================================================  SRSS.CLK_ECO_CONFIG  ================================================== */
#define SRSS_CLK_ECO_CONFIG_AGC_EN_Pos    (1UL)                 /*!< SRSS CLK_ECO_CONFIG: AGC_EN (Bit 1)                       */
#define SRSS_CLK_ECO_CONFIG_AGC_EN_Msk    (0x2UL)               /*!< SRSS CLK_ECO_CONFIG: AGC_EN (Bitfield-Mask: 0x01)         */
#define SRSS_CLK_ECO_CONFIG_ECO_EN_Pos    (31UL)                /*!< SRSS CLK_ECO_CONFIG: ECO_EN (Bit 31)                      */
#define SRSS_CLK_ECO_CONFIG_ECO_EN_Msk    (0x80000000UL)        /*!< SRSS CLK_ECO_CONFIG: ECO_EN (Bitfield-Mask: 0x01)         */
/* ==================================================  SRSS.CLK_ECO_STATUS  ================================================== */
#define SRSS_CLK_ECO_STATUS_ECO_OK_Pos    (0UL)                 /*!< SRSS CLK_ECO_STATUS: ECO_OK (Bit 0)                       */
#define SRSS_CLK_ECO_STATUS_ECO_OK_Msk    (0x1UL)               /*!< SRSS CLK_ECO_STATUS: ECO_OK (Bitfield-Mask: 0x01)         */
#define SRSS_CLK_ECO_STATUS_ECO_READY_Pos (1UL)                 /*!< SRSS CLK_ECO_STATUS: ECO_READY (Bit 1)                    */
#define SRSS_CLK_ECO_STATUS_ECO_READY_Msk (0x2UL)               /*!< SRSS CLK_ECO_STATUS: ECO_READY (Bitfield-Mask: 0x01)      */
/* ===================================================  SRSS.CLK_WCO_DPLL  =================================================== */
#define SRSS_CLK_WCO_DPLL_DPLL_MULT_Pos   (0UL)                 /*!< SRSS CLK_WCO_DPLL: DPLL_MULT (Bit 0)                      */
#define SRSS_CLK_WCO_DPLL_DPLL_MULT_Msk   (0x7ffUL)             /*!< SRSS CLK_WCO_DPLL: DPLL_MULT (Bitfield-Mask: 0x7ff)       */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_IGAIN_Pos (16UL)              /*!< SRSS CLK_WCO_DPLL: DPLL_LF_IGAIN (Bit 16)                 */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_IGAIN_Msk (0x70000UL)         /*!< SRSS CLK_WCO_DPLL: DPLL_LF_IGAIN (Bitfield-Mask: 0x07)    */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_PGAIN_Pos (19UL)              /*!< SRSS CLK_WCO_DPLL: DPLL_LF_PGAIN (Bit 19)                 */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_PGAIN_Msk (0x380000UL)        /*!< SRSS CLK_WCO_DPLL: DPLL_LF_PGAIN (Bitfield-Mask: 0x07)    */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_LIMIT_Pos (22UL)              /*!< SRSS CLK_WCO_DPLL: DPLL_LF_LIMIT (Bit 22)                 */
#define SRSS_CLK_WCO_DPLL_DPLL_LF_LIMIT_Msk (0x3fc00000UL)      /*!< SRSS CLK_WCO_DPLL: DPLL_LF_LIMIT (Bitfield-Mask: 0xff)    */
#define SRSS_CLK_WCO_DPLL_DPLL_EN_Pos     (31UL)                /*!< SRSS CLK_WCO_DPLL: DPLL_EN (Bit 31)                       */
#define SRSS_CLK_WCO_DPLL_DPLL_EN_Msk     (0x80000000UL)        /*!< SRSS CLK_WCO_DPLL: DPLL_EN (Bitfield-Mask: 0x01)          */
/* =================================================  SRSS.CLK_PILO_CONFIG  ================================================== */
#define SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Pos (0UL)               /*!< SRSS CLK_PILO_CONFIG: PILO_FFREQ (Bit 0)                  */
#define SRSS_CLK_PILO_CONFIG_PILO_FFREQ_Msk (0x3ffUL)           /*!< SRSS CLK_PILO_CONFIG: PILO_FFREQ (Bitfield-Mask: 0x3ff)   */
#define SRSS_CLK_PILO_CONFIG_PILO_CLK_EN_Pos (29UL)             /*!< SRSS CLK_PILO_CONFIG: PILO_CLK_EN (Bit 29)                */
#define SRSS_CLK_PILO_CONFIG_PILO_CLK_EN_Msk (0x20000000UL)     /*!< SRSS CLK_PILO_CONFIG: PILO_CLK_EN (Bitfield-Mask: 0x01)   */
#define SRSS_CLK_PILO_CONFIG_PILO_RESET_N_Pos (30UL)            /*!< SRSS CLK_PILO_CONFIG: PILO_RESET_N (Bit 30)               */
#define SRSS_CLK_PILO_CONFIG_PILO_RESET_N_Msk (0x40000000UL)    /*!< SRSS CLK_PILO_CONFIG: PILO_RESET_N (Bitfield-Mask: 0x01)  */
#define SRSS_CLK_PILO_CONFIG_PILO_EN_Pos  (31UL)                /*!< SRSS CLK_PILO_CONFIG: PILO_EN (Bit 31)                    */
#define SRSS_CLK_PILO_CONFIG_PILO_EN_Msk  (0x80000000UL)        /*!< SRSS CLK_PILO_CONFIG: PILO_EN (Bitfield-Mask: 0x01)       */
/* ==================================================  SRSS.CLK_FLL_CONFIG  ================================================== */
#define SRSS_CLK_FLL_CONFIG_FLL_MULT_Pos  (0UL)                 /*!< SRSS CLK_FLL_CONFIG: FLL_MULT (Bit 0)                     */
#define SRSS_CLK_FLL_CONFIG_FLL_MULT_Msk  (0x3ffffUL)           /*!< SRSS CLK_FLL_CONFIG: FLL_MULT (Bitfield-Mask: 0x3ffff)    */
#define SRSS_CLK_FLL_CONFIG_FLL_OUTPUT_DIV_Pos (24UL)           /*!< SRSS CLK_FLL_CONFIG: FLL_OUTPUT_DIV (Bit 24)              */
#define SRSS_CLK_FLL_CONFIG_FLL_OUTPUT_DIV_Msk (0x1000000UL)    /*!< SRSS CLK_FLL_CONFIG: FLL_OUTPUT_DIV (Bitfield-Mask: 0x01) */
#define SRSS_CLK_FLL_CONFIG_FLL_ENABLE_Pos (31UL)               /*!< SRSS CLK_FLL_CONFIG: FLL_ENABLE (Bit 31)                  */
#define SRSS_CLK_FLL_CONFIG_FLL_ENABLE_Msk (0x80000000UL)       /*!< SRSS CLK_FLL_CONFIG: FLL_ENABLE (Bitfield-Mask: 0x01)     */
/* =================================================  SRSS.CLK_FLL_CONFIG2  ================================================== */
#define SRSS_CLK_FLL_CONFIG2_FLL_REF_DIV_Pos (0UL)              /*!< SRSS CLK_FLL_CONFIG2: FLL_REF_DIV (Bit 0)                 */
#define SRSS_CLK_FLL_CONFIG2_FLL_REF_DIV_Msk (0x1fffUL)         /*!< SRSS CLK_FLL_CONFIG2: FLL_REF_DIV (Bitfield-Mask: 0x1fff) */
#define SRSS_CLK_FLL_CONFIG2_LOCK_TOL_Pos (16UL)                /*!< SRSS CLK_FLL_CONFIG2: LOCK_TOL (Bit 16)                   */
#define SRSS_CLK_FLL_CONFIG2_LOCK_TOL_Msk (0x1ff0000UL)         /*!< SRSS CLK_FLL_CONFIG2: LOCK_TOL (Bitfield-Mask: 0x1ff)     */
/* =================================================  SRSS.CLK_FLL_CONFIG3  ================================================== */
#define SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Pos (0UL)             /*!< SRSS CLK_FLL_CONFIG3: FLL_LF_IGAIN (Bit 0)                */
#define SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Msk (0xfUL)           /*!< SRSS CLK_FLL_CONFIG3: FLL_LF_IGAIN (Bitfield-Mask: 0x0f)  */
#define SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Pos (4UL)             /*!< SRSS CLK_FLL_CONFIG3: FLL_LF_PGAIN (Bit 4)                */
#define SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Msk (0xf0UL)          /*!< SRSS CLK_FLL_CONFIG3: FLL_LF_PGAIN (Bitfield-Mask: 0x0f)  */
#define SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Pos (8UL)           /*!< SRSS CLK_FLL_CONFIG3: SETTLING_COUNT (Bit 8)              */
#define SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Msk (0x1fff00UL)    /*!< SRSS CLK_FLL_CONFIG3: SETTLING_COUNT (Bitfield-Mask: 0x1fff)*/
#define SRSS_CLK_FLL_CONFIG3_BYPASS_SEL_Pos (28UL)              /*!< SRSS CLK_FLL_CONFIG3: BYPASS_SEL (Bit 28)                 */
#define SRSS_CLK_FLL_CONFIG3_BYPASS_SEL_Msk (0x30000000UL)      /*!< SRSS CLK_FLL_CONFIG3: BYPASS_SEL (Bitfield-Mask: 0x03)    */
/* =================================================  SRSS.CLK_FLL_CONFIG4  ================================================== */
#define SRSS_CLK_FLL_CONFIG4_CCO_LIMIT_Pos (0UL)                /*!< SRSS CLK_FLL_CONFIG4: CCO_LIMIT (Bit 0)                   */
#define SRSS_CLK_FLL_CONFIG4_CCO_LIMIT_Msk (0xffUL)             /*!< SRSS CLK_FLL_CONFIG4: CCO_LIMIT (Bitfield-Mask: 0xff)     */
#define SRSS_CLK_FLL_CONFIG4_CCO_RANGE_Pos (8UL)                /*!< SRSS CLK_FLL_CONFIG4: CCO_RANGE (Bit 8)                   */
#define SRSS_CLK_FLL_CONFIG4_CCO_RANGE_Msk (0x700UL)            /*!< SRSS CLK_FLL_CONFIG4: CCO_RANGE (Bitfield-Mask: 0x07)     */
#define SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Pos (16UL)                /*!< SRSS CLK_FLL_CONFIG4: CCO_FREQ (Bit 16)                   */
#define SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Msk (0x1ff0000UL)         /*!< SRSS CLK_FLL_CONFIG4: CCO_FREQ (Bitfield-Mask: 0x1ff)     */
#define SRSS_CLK_FLL_CONFIG4_CCO_ENABLE_Pos (31UL)              /*!< SRSS CLK_FLL_CONFIG4: CCO_ENABLE (Bit 31)                 */
#define SRSS_CLK_FLL_CONFIG4_CCO_ENABLE_Msk (0x80000000UL)      /*!< SRSS CLK_FLL_CONFIG4: CCO_ENABLE (Bitfield-Mask: 0x01)    */
/* ==================================================  SRSS.CLK_FLL_STATUS  ================================================== */
#define SRSS_CLK_FLL_STATUS_LOCKED_Pos    (0UL)                 /*!< SRSS CLK_FLL_STATUS: LOCKED (Bit 0)                       */
#define SRSS_CLK_FLL_STATUS_LOCKED_Msk    (0x1UL)               /*!< SRSS CLK_FLL_STATUS: LOCKED (Bitfield-Mask: 0x01)         */
#define SRSS_CLK_FLL_STATUS_UNLOCK_OCCURRED_Pos (1UL)           /*!< SRSS CLK_FLL_STATUS: UNLOCK_OCCURRED (Bit 1)              */
#define SRSS_CLK_FLL_STATUS_UNLOCK_OCCURRED_Msk (0x2UL)         /*!< SRSS CLK_FLL_STATUS: UNLOCK_OCCURRED (Bitfield-Mask: 0x01)*/
#define SRSS_CLK_FLL_STATUS_CCO_READY_Pos (2UL)                 /*!< SRSS CLK_FLL_STATUS: CCO_READY (Bit 2)                    */
#define SRSS_CLK_FLL_STATUS_CCO_READY_Msk (0x4UL)               /*!< SRSS CLK_FLL_STATUS: CCO_READY (Bitfield-Mask: 0x01)      */
/* ==================================================  SRSS.CLK_PLL_CONFIG  ================================================== */
#define SRSS_CLK_PLL_CONFIG_FEEDBACK_DIV_Pos (0UL)              /*!< SRSS CLK_PLL_CONFIG: FEEDBACK_DIV (Bit 0)                 */
#define SRSS_CLK_PLL_CONFIG_FEEDBACK_DIV_Msk (0x7fUL)           /*!< SRSS CLK_PLL_CONFIG: FEEDBACK_DIV (Bitfield-Mask: 0x7f)   */
#define SRSS_CLK_PLL_CONFIG_REFERENCE_DIV_Pos (8UL)             /*!< SRSS CLK_PLL_CONFIG: REFERENCE_DIV (Bit 8)                */
#define SRSS_CLK_PLL_CONFIG_REFERENCE_DIV_Msk (0x1f00UL)        /*!< SRSS CLK_PLL_CONFIG: REFERENCE_DIV (Bitfield-Mask: 0x1f)  */
#define SRSS_CLK_PLL_CONFIG_OUTPUT_DIV_Pos (16UL)               /*!< SRSS CLK_PLL_CONFIG: OUTPUT_DIV (Bit 16)                  */
#define SRSS_CLK_PLL_CONFIG_OUTPUT_DIV_Msk (0x1f0000UL)         /*!< SRSS CLK_PLL_CONFIG: OUTPUT_DIV (Bitfield-Mask: 0x1f)     */
#define SRSS_CLK_PLL_CONFIG_PLL_LF_MODE_Pos (27UL)              /*!< SRSS CLK_PLL_CONFIG: PLL_LF_MODE (Bit 27)                 */
#define SRSS_CLK_PLL_CONFIG_PLL_LF_MODE_Msk (0x8000000UL)       /*!< SRSS CLK_PLL_CONFIG: PLL_LF_MODE (Bitfield-Mask: 0x01)    */
#define SRSS_CLK_PLL_CONFIG_BYPASS_SEL_Pos (28UL)               /*!< SRSS CLK_PLL_CONFIG: BYPASS_SEL (Bit 28)                  */
#define SRSS_CLK_PLL_CONFIG_BYPASS_SEL_Msk (0x30000000UL)       /*!< SRSS CLK_PLL_CONFIG: BYPASS_SEL (Bitfield-Mask: 0x03)     */
#define SRSS_CLK_PLL_CONFIG_ENABLE_Pos    (31UL)                /*!< SRSS CLK_PLL_CONFIG: ENABLE (Bit 31)                      */
#define SRSS_CLK_PLL_CONFIG_ENABLE_Msk    (0x80000000UL)        /*!< SRSS CLK_PLL_CONFIG: ENABLE (Bitfield-Mask: 0x01)         */
/* ==================================================  SRSS.CLK_PLL_STATUS  ================================================== */
#define SRSS_CLK_PLL_STATUS_LOCKED_Pos    (0UL)                 /*!< SRSS CLK_PLL_STATUS: LOCKED (Bit 0)                       */
#define SRSS_CLK_PLL_STATUS_LOCKED_Msk    (0x1UL)               /*!< SRSS CLK_PLL_STATUS: LOCKED (Bitfield-Mask: 0x01)         */
#define SRSS_CLK_PLL_STATUS_UNLOCK_OCCURRED_Pos (1UL)           /*!< SRSS CLK_PLL_STATUS: UNLOCK_OCCURRED (Bit 1)              */
#define SRSS_CLK_PLL_STATUS_UNLOCK_OCCURRED_Msk (0x2UL)         /*!< SRSS CLK_PLL_STATUS: UNLOCK_OCCURRED (Bitfield-Mask: 0x01)*/
/* ====================================================  SRSS.SRSS_INTR  ===================================================== */
#define SRSS_SRSS_INTR_WDT_MATCH_Pos      (0UL)                 /*!< SRSS SRSS_INTR: WDT_MATCH (Bit 0)                         */
#define SRSS_SRSS_INTR_WDT_MATCH_Msk      (0x1UL)               /*!< SRSS SRSS_INTR: WDT_MATCH (Bitfield-Mask: 0x01)           */
#define SRSS_SRSS_INTR_HVLVD1_Pos         (1UL)                 /*!< SRSS SRSS_INTR: HVLVD1 (Bit 1)                            */
#define SRSS_SRSS_INTR_HVLVD1_Msk         (0x2UL)               /*!< SRSS SRSS_INTR: HVLVD1 (Bitfield-Mask: 0x01)              */
#define SRSS_SRSS_INTR_CLK_CAL_Pos        (5UL)                 /*!< SRSS SRSS_INTR: CLK_CAL (Bit 5)                           */
#define SRSS_SRSS_INTR_CLK_CAL_Msk        (0x20UL)              /*!< SRSS SRSS_INTR: CLK_CAL (Bitfield-Mask: 0x01)             */
/* ==================================================  SRSS.SRSS_INTR_SET  =================================================== */
#define SRSS_SRSS_INTR_SET_WDT_MATCH_Pos  (0UL)                 /*!< SRSS SRSS_INTR_SET: WDT_MATCH (Bit 0)                     */
#define SRSS_SRSS_INTR_SET_WDT_MATCH_Msk  (0x1UL)               /*!< SRSS SRSS_INTR_SET: WDT_MATCH (Bitfield-Mask: 0x01)       */
#define SRSS_SRSS_INTR_SET_HVLVD1_Pos     (1UL)                 /*!< SRSS SRSS_INTR_SET: HVLVD1 (Bit 1)                        */
#define SRSS_SRSS_INTR_SET_HVLVD1_Msk     (0x2UL)               /*!< SRSS SRSS_INTR_SET: HVLVD1 (Bitfield-Mask: 0x01)          */
#define SRSS_SRSS_INTR_SET_CLK_CAL_Pos    (5UL)                 /*!< SRSS SRSS_INTR_SET: CLK_CAL (Bit 5)                       */
#define SRSS_SRSS_INTR_SET_CLK_CAL_Msk    (0x20UL)              /*!< SRSS SRSS_INTR_SET: CLK_CAL (Bitfield-Mask: 0x01)         */
/* ==================================================  SRSS.SRSS_INTR_MASK  ================================================== */
#define SRSS_SRSS_INTR_MASK_WDT_MATCH_Pos (0UL)                 /*!< SRSS SRSS_INTR_MASK: WDT_MATCH (Bit 0)                    */
#define SRSS_SRSS_INTR_MASK_WDT_MATCH_Msk (0x1UL)               /*!< SRSS SRSS_INTR_MASK: WDT_MATCH (Bitfield-Mask: 0x01)      */
#define SRSS_SRSS_INTR_MASK_HVLVD1_Pos    (1UL)                 /*!< SRSS SRSS_INTR_MASK: HVLVD1 (Bit 1)                       */
#define SRSS_SRSS_INTR_MASK_HVLVD1_Msk    (0x2UL)               /*!< SRSS SRSS_INTR_MASK: HVLVD1 (Bitfield-Mask: 0x01)         */
#define SRSS_SRSS_INTR_MASK_CLK_CAL_Pos   (5UL)                 /*!< SRSS SRSS_INTR_MASK: CLK_CAL (Bit 5)                      */
#define SRSS_SRSS_INTR_MASK_CLK_CAL_Msk   (0x20UL)              /*!< SRSS SRSS_INTR_MASK: CLK_CAL (Bitfield-Mask: 0x01)        */
/* =================================================  SRSS.SRSS_INTR_MASKED  ================================================= */
#define SRSS_SRSS_INTR_MASKED_WDT_MATCH_Pos (0UL)               /*!< SRSS SRSS_INTR_MASKED: WDT_MATCH (Bit 0)                  */
#define SRSS_SRSS_INTR_MASKED_WDT_MATCH_Msk (0x1UL)             /*!< SRSS SRSS_INTR_MASKED: WDT_MATCH (Bitfield-Mask: 0x01)    */
#define SRSS_SRSS_INTR_MASKED_HVLVD1_Pos  (1UL)                 /*!< SRSS SRSS_INTR_MASKED: HVLVD1 (Bit 1)                     */
#define SRSS_SRSS_INTR_MASKED_HVLVD1_Msk  (0x2UL)               /*!< SRSS SRSS_INTR_MASKED: HVLVD1 (Bitfield-Mask: 0x01)       */
#define SRSS_SRSS_INTR_MASKED_CLK_CAL_Pos (5UL)                 /*!< SRSS SRSS_INTR_MASKED: CLK_CAL (Bit 5)                    */
#define SRSS_SRSS_INTR_MASKED_CLK_CAL_Msk (0x20UL)              /*!< SRSS SRSS_INTR_MASKED: CLK_CAL (Bitfield-Mask: 0x01)      */
/* ==================================================  SRSS.SRSS_INTR_CFG  =================================================== */
#define SRSS_SRSS_INTR_CFG_HVLVD1_EDGE_SEL_Pos (0UL)            /*!< SRSS SRSS_INTR_CFG: HVLVD1_EDGE_SEL (Bit 0)               */
#define SRSS_SRSS_INTR_CFG_HVLVD1_EDGE_SEL_Msk (0x3UL)          /*!< SRSS SRSS_INTR_CFG: HVLVD1_EDGE_SEL (Bitfield-Mask: 0x03) */
/* ====================================================  SRSS.RES_CAUSE  ===================================================== */
#define SRSS_RES_CAUSE_RESET_WDT_Pos      (0UL)                 /*!< SRSS RES_CAUSE: RESET_WDT (Bit 0)                         */
#define SRSS_RES_CAUSE_RESET_WDT_Msk      (0x1UL)               /*!< SRSS RES_CAUSE: RESET_WDT (Bitfield-Mask: 0x01)           */
#define SRSS_RES_CAUSE_RESET_ACT_FAULT_Pos (1UL)                /*!< SRSS RES_CAUSE: RESET_ACT_FAULT (Bit 1)                   */
#define SRSS_RES_CAUSE_RESET_ACT_FAULT_Msk (0x2UL)              /*!< SRSS RES_CAUSE: RESET_ACT_FAULT (Bitfield-Mask: 0x01)     */
#define SRSS_RES_CAUSE_RESET_DPSLP_FAULT_Pos (2UL)              /*!< SRSS RES_CAUSE: RESET_DPSLP_FAULT (Bit 2)                 */
#define SRSS_RES_CAUSE_RESET_DPSLP_FAULT_Msk (0x4UL)            /*!< SRSS RES_CAUSE: RESET_DPSLP_FAULT (Bitfield-Mask: 0x01)   */
#define SRSS_RES_CAUSE_RESET_CSV_WCO_LOSS_Pos (3UL)             /*!< SRSS RES_CAUSE: RESET_CSV_WCO_LOSS (Bit 3)                */
#define SRSS_RES_CAUSE_RESET_CSV_WCO_LOSS_Msk (0x8UL)           /*!< SRSS RES_CAUSE: RESET_CSV_WCO_LOSS (Bitfield-Mask: 0x01)  */
#define SRSS_RES_CAUSE_RESET_SOFT_Pos     (4UL)                 /*!< SRSS RES_CAUSE: RESET_SOFT (Bit 4)                        */
#define SRSS_RES_CAUSE_RESET_SOFT_Msk     (0x10UL)              /*!< SRSS RES_CAUSE: RESET_SOFT (Bitfield-Mask: 0x01)          */
#define SRSS_RES_CAUSE_RESET_MCWDT0_Pos   (5UL)                 /*!< SRSS RES_CAUSE: RESET_MCWDT0 (Bit 5)                      */
#define SRSS_RES_CAUSE_RESET_MCWDT0_Msk   (0x20UL)              /*!< SRSS RES_CAUSE: RESET_MCWDT0 (Bitfield-Mask: 0x01)        */
#define SRSS_RES_CAUSE_RESET_MCWDT1_Pos   (6UL)                 /*!< SRSS RES_CAUSE: RESET_MCWDT1 (Bit 6)                      */
#define SRSS_RES_CAUSE_RESET_MCWDT1_Msk   (0x40UL)              /*!< SRSS RES_CAUSE: RESET_MCWDT1 (Bitfield-Mask: 0x01)        */
#define SRSS_RES_CAUSE_RESET_MCWDT2_Pos   (7UL)                 /*!< SRSS RES_CAUSE: RESET_MCWDT2 (Bit 7)                      */
#define SRSS_RES_CAUSE_RESET_MCWDT2_Msk   (0x80UL)              /*!< SRSS RES_CAUSE: RESET_MCWDT2 (Bitfield-Mask: 0x01)        */
#define SRSS_RES_CAUSE_RESET_MCWDT3_Pos   (8UL)                 /*!< SRSS RES_CAUSE: RESET_MCWDT3 (Bit 8)                      */
#define SRSS_RES_CAUSE_RESET_MCWDT3_Msk   (0x100UL)             /*!< SRSS RES_CAUSE: RESET_MCWDT3 (Bitfield-Mask: 0x01)        */
/* ====================================================  SRSS.RES_CAUSE2  ==================================================== */
#define SRSS_RES_CAUSE2_RESET_CSV_HF_LOSS_Pos (0UL)             /*!< SRSS RES_CAUSE2: RESET_CSV_HF_LOSS (Bit 0)                */
#define SRSS_RES_CAUSE2_RESET_CSV_HF_LOSS_Msk (0xffffUL)        /*!< SRSS RES_CAUSE2: RESET_CSV_HF_LOSS (Bitfield-Mask: 0xffff)*/
#define SRSS_RES_CAUSE2_RESET_CSV_HF_FREQ_Pos (16UL)            /*!< SRSS RES_CAUSE2: RESET_CSV_HF_FREQ (Bit 16)               */
#define SRSS_RES_CAUSE2_RESET_CSV_HF_FREQ_Msk (0xffff0000UL)    /*!< SRSS RES_CAUSE2: RESET_CSV_HF_FREQ (Bitfield-Mask: 0xffff)*/
/* =================================================  SRSS.PWR_TRIM_REF_CTL  ================================================= */
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_TCTRIM_Pos (0UL)          /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_TCTRIM (Bit 0)             */
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_TCTRIM_Msk (0xfUL)        /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_TCTRIM (Bitfield-Mask: 0x0f)*/
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_ITRIM_Pos (4UL)           /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_ITRIM (Bit 4)              */
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_ITRIM_Msk (0xf0UL)        /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_ITRIM (Bitfield-Mask: 0x0f)*/
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_ABSTRIM_Pos (8UL)         /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_ABSTRIM (Bit 8)            */
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_ABSTRIM_Msk (0x1f00UL)    /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_ABSTRIM (Bitfield-Mask: 0x1f)*/
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_IBOOST_Pos (14UL)         /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_IBOOST (Bit 14)            */
#define SRSS_PWR_TRIM_REF_CTL_ACT_REF_IBOOST_Msk (0x4000UL)     /*!< SRSS PWR_TRIM_REF_CTL: ACT_REF_IBOOST (Bitfield-Mask: 0x01)*/
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_TCTRIM_Pos (16UL)       /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_TCTRIM (Bit 16)          */
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_TCTRIM_Msk (0xf0000UL)  /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_TCTRIM (Bitfield-Mask: 0x0f)*/
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_ABSTRIM_Pos (20UL)      /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_ABSTRIM (Bit 20)         */
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_ABSTRIM_Msk (0x1f00000UL) /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_ABSTRIM (Bitfield-Mask: 0x1f)*/
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_ITRIM_Pos (28UL)        /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_ITRIM (Bit 28)           */
#define SRSS_PWR_TRIM_REF_CTL_DPSLP_REF_ITRIM_Msk (0xf0000000UL) /*!< SRSS PWR_TRIM_REF_CTL: DPSLP_REF_ITRIM (Bitfield-Mask: 0x0f)*/
/* ===============================================  SRSS.PWR_TRIM_BODOVP_CTL  ================================================ */
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_TRIPSEL_Pos (0UL)     /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_TRIPSEL (Bit 0)        */
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_TRIPSEL_Msk (0x7UL)   /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_TRIPSEL (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_OFSTRIM_Pos (4UL)     /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_OFSTRIM (Bit 4)        */
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_OFSTRIM_Msk (0x70UL)  /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_OFSTRIM (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_ITRIM_Pos (7UL)       /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_ITRIM (Bit 7)          */
#define SRSS_PWR_TRIM_BODOVP_CTL_HVPORBOD_ITRIM_Msk (0x380UL)   /*!< SRSS PWR_TRIM_BODOVP_CTL: HVPORBOD_ITRIM (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_TRIPSEL_Pos (10UL)    /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_TRIPSEL (Bit 10)       */
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_TRIPSEL_Msk (0x1c00UL) /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_TRIPSEL (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_OFSTRIM_Pos (14UL)    /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_OFSTRIM (Bit 14)       */
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_OFSTRIM_Msk (0x1c000UL) /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_OFSTRIM (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_ITRIM_Pos (17UL)      /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_ITRIM (Bit 17)         */
#define SRSS_PWR_TRIM_BODOVP_CTL_LVPORBOD_ITRIM_Msk (0xe0000UL) /*!< SRSS PWR_TRIM_BODOVP_CTL: LVPORBOD_ITRIM (Bitfield-Mask: 0x07)*/
/* =================================================  SRSS.CLK_TRIM_CCO_CTL  ================================================= */
#define SRSS_CLK_TRIM_CCO_CTL_CCO_RCSTRIM_Pos (0UL)             /*!< SRSS CLK_TRIM_CCO_CTL: CCO_RCSTRIM (Bit 0)                */
#define SRSS_CLK_TRIM_CCO_CTL_CCO_RCSTRIM_Msk (0x3fUL)          /*!< SRSS CLK_TRIM_CCO_CTL: CCO_RCSTRIM (Bitfield-Mask: 0x3f)  */
#define SRSS_CLK_TRIM_CCO_CTL_CCO_STABLE_CNT_Pos (24UL)         /*!< SRSS CLK_TRIM_CCO_CTL: CCO_STABLE_CNT (Bit 24)            */
#define SRSS_CLK_TRIM_CCO_CTL_CCO_STABLE_CNT_Msk (0x3f000000UL) /*!< SRSS CLK_TRIM_CCO_CTL: CCO_STABLE_CNT (Bitfield-Mask: 0x3f)*/
#define SRSS_CLK_TRIM_CCO_CTL_ENABLE_CNT_Pos (31UL)             /*!< SRSS CLK_TRIM_CCO_CTL: ENABLE_CNT (Bit 31)                */
#define SRSS_CLK_TRIM_CCO_CTL_ENABLE_CNT_Msk (0x80000000UL)     /*!< SRSS CLK_TRIM_CCO_CTL: ENABLE_CNT (Bitfield-Mask: 0x01)   */
/* ================================================  SRSS.CLK_TRIM_CCO_CTL2  ================================================= */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM1_Pos (0UL)            /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM1 (Bit 0)               */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM1_Msk (0x1fUL)         /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM1 (Bitfield-Mask: 0x1f) */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM2_Pos (5UL)            /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM2 (Bit 5)               */
