ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_srss.h
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM2_Msk (0x3e0UL)        /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM2 (Bitfield-Mask: 0x1f) */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM3_Pos (10UL)           /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM3 (Bit 10)              */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM3_Msk (0x7c00UL)       /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM3 (Bitfield-Mask: 0x1f) */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM4_Pos (15UL)           /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM4 (Bit 15)              */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM4_Msk (0xf8000UL)      /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM4 (Bitfield-Mask: 0x1f) */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM5_Pos (20UL)           /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM5 (Bit 20)              */
#define SRSS_CLK_TRIM_CCO_CTL2_CCO_FCTRIM5_Msk (0x1f00000UL)    /*!< SRSS CLK_TRIM_CCO_CTL2: CCO_FCTRIM5 (Bitfield-Mask: 0x1f) */
/* ================================================  SRSS.PWR_TRIM_WAKE_CTL  ================================================= */
#define SRSS_PWR_TRIM_WAKE_CTL_WAKE_DELAY_Pos (0UL)             /*!< SRSS PWR_TRIM_WAKE_CTL: WAKE_DELAY (Bit 0)                */
#define SRSS_PWR_TRIM_WAKE_CTL_WAKE_DELAY_Msk (0xffUL)          /*!< SRSS PWR_TRIM_WAKE_CTL: WAKE_DELAY (Bitfield-Mask: 0xff)  */
/* =================================================  SRSS.PWR_TRIM_LVD_CTL  ================================================= */
#define SRSS_PWR_TRIM_LVD_CTL_HVLVD1_OFSTRIM_Pos (0UL)          /*!< SRSS PWR_TRIM_LVD_CTL: HVLVD1_OFSTRIM (Bit 0)             */
#define SRSS_PWR_TRIM_LVD_CTL_HVLVD1_OFSTRIM_Msk (0x7UL)        /*!< SRSS PWR_TRIM_LVD_CTL: HVLVD1_OFSTRIM (Bitfield-Mask: 0x07)*/
#define SRSS_PWR_TRIM_LVD_CTL_HVLVD1_ITRIM_Pos (4UL)            /*!< SRSS PWR_TRIM_LVD_CTL: HVLVD1_ITRIM (Bit 4)               */
#define SRSS_PWR_TRIM_LVD_CTL_HVLVD1_ITRIM_Msk (0x70UL)         /*!< SRSS PWR_TRIM_LVD_CTL: HVLVD1_ITRIM (Bitfield-Mask: 0x07) */
/* =================================================  SRSS.CLK_TRIM_ILO_CTL  ================================================= */
#define SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM_Pos (0UL)               /*!< SRSS CLK_TRIM_ILO_CTL: ILO_FTRIM (Bit 0)                  */
#define SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM_Msk (0x3fUL)            /*!< SRSS CLK_TRIM_ILO_CTL: ILO_FTRIM (Bitfield-Mask: 0x3f)    */
/* ===============================================  SRSS.PWR_TRIM_PWRSYS_CTL  ================================================ */
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Pos (0UL)         /*!< SRSS PWR_TRIM_PWRSYS_CTL: ACT_REG_TRIM (Bit 0)            */
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM_Msk (0x1fUL)      /*!< SRSS PWR_TRIM_PWRSYS_CTL: ACT_REG_TRIM (Bitfield-Mask: 0x1f)*/
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Pos (30UL)       /*!< SRSS PWR_TRIM_PWRSYS_CTL: ACT_REG_BOOST (Bit 30)          */
#define SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_BOOST_Msk (0xc0000000UL) /*!< SRSS PWR_TRIM_PWRSYS_CTL: ACT_REG_BOOST (Bitfield-Mask: 0x03)*/
/* =================================================  SRSS.CLK_TRIM_ECO_CTL  ================================================= */
#define SRSS_CLK_TRIM_ECO_CTL_WDTRIM_Pos  (0UL)                 /*!< SRSS CLK_TRIM_ECO_CTL: WDTRIM (Bit 0)                     */
#define SRSS_CLK_TRIM_ECO_CTL_WDTRIM_Msk  (0x7UL)               /*!< SRSS CLK_TRIM_ECO_CTL: WDTRIM (Bitfield-Mask: 0x07)       */
#define SRSS_CLK_TRIM_ECO_CTL_ATRIM_Pos   (4UL)                 /*!< SRSS CLK_TRIM_ECO_CTL: ATRIM (Bit 4)                      */
#define SRSS_CLK_TRIM_ECO_CTL_ATRIM_Msk   (0xf0UL)              /*!< SRSS CLK_TRIM_ECO_CTL: ATRIM (Bitfield-Mask: 0x0f)        */
#define SRSS_CLK_TRIM_ECO_CTL_FTRIM_Pos   (8UL)                 /*!< SRSS CLK_TRIM_ECO_CTL: FTRIM (Bit 8)                      */
#define SRSS_CLK_TRIM_ECO_CTL_FTRIM_Msk   (0x300UL)             /*!< SRSS CLK_TRIM_ECO_CTL: FTRIM (Bitfield-Mask: 0x03)        */
#define SRSS_CLK_TRIM_ECO_CTL_RTRIM_Pos   (10UL)                /*!< SRSS CLK_TRIM_ECO_CTL: RTRIM (Bit 10)                     */
#define SRSS_CLK_TRIM_ECO_CTL_RTRIM_Msk   (0xc00UL)             /*!< SRSS CLK_TRIM_ECO_CTL: RTRIM (Bitfield-Mask: 0x03)        */
#define SRSS_CLK_TRIM_ECO_CTL_GTRIM_Pos   (12UL)                /*!< SRSS CLK_TRIM_ECO_CTL: GTRIM (Bit 12)                     */
#define SRSS_CLK_TRIM_ECO_CTL_GTRIM_Msk   (0x3000UL)            /*!< SRSS CLK_TRIM_ECO_CTL: GTRIM (Bitfield-Mask: 0x03)        */
#define SRSS_CLK_TRIM_ECO_CTL_ITRIM_Pos   (16UL)                /*!< SRSS CLK_TRIM_ECO_CTL: ITRIM (Bit 16)                     */
#define SRSS_CLK_TRIM_ECO_CTL_ITRIM_Msk   (0x3f0000UL)          /*!< SRSS CLK_TRIM_ECO_CTL: ITRIM (Bitfield-Mask: 0x3f)        */
/* ================================================  SRSS.CLK_TRIM_PILO_CTL  ================================================= */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ_Pos (0UL)             /*!< SRSS CLK_TRIM_PILO_CTL: PILO_CFREQ (Bit 0)                */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_CFREQ_Msk (0x3fUL)          /*!< SRSS CLK_TRIM_PILO_CTL: PILO_CFREQ (Bitfield-Mask: 0x3f)  */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Pos (12UL)         /*!< SRSS CLK_TRIM_PILO_CTL: PILO_OSC_TRIM (Bit 12)            */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_OSC_TRIM_Msk (0x7000UL)     /*!< SRSS CLK_TRIM_PILO_CTL: PILO_OSC_TRIM (Bitfield-Mask: 0x07)*/
#define SRSS_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Pos (16UL)        /*!< SRSS CLK_TRIM_PILO_CTL: PILO_COMP_TRIM (Bit 16)           */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_COMP_TRIM_Msk (0x30000UL)   /*!< SRSS CLK_TRIM_PILO_CTL: PILO_COMP_TRIM (Bitfield-Mask: 0x03)*/
#define SRSS_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Pos (18UL)       /*!< SRSS CLK_TRIM_PILO_CTL: PILO_NBIAS_TRIM (Bit 18)          */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_NBIAS_TRIM_Msk (0xc0000UL)  /*!< SRSS CLK_TRIM_PILO_CTL: PILO_NBIAS_TRIM (Bitfield-Mask: 0x03)*/
#define SRSS_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Pos (20UL)         /*!< SRSS CLK_TRIM_PILO_CTL: PILO_RES_TRIM (Bit 20)            */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_RES_TRIM_Msk (0x1f00000UL)  /*!< SRSS CLK_TRIM_PILO_CTL: PILO_RES_TRIM (Bitfield-Mask: 0x1f)*/
#define SRSS_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Pos (26UL)      /*!< SRSS CLK_TRIM_PILO_CTL: PILO_ISLOPE_TRIM (Bit 26)         */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_ISLOPE_TRIM_Msk (0xc000000UL) /*!< SRSS CLK_TRIM_PILO_CTL: PILO_ISLOPE_TRIM (Bitfield-Mask: 0x03)*/
#define SRSS_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Pos (28UL)      /*!< SRSS CLK_TRIM_PILO_CTL: PILO_VTDIFF_TRIM (Bit 28)         */
#define SRSS_CLK_TRIM_PILO_CTL_PILO_VTDIFF_TRIM_Msk (0x70000000UL) /*!< SRSS CLK_TRIM_PILO_CTL: PILO_VTDIFF_TRIM (Bitfield-Mask: 0x07)*/
/* ================================================  SRSS.CLK_TRIM_PILO_CTL2  ================================================ */
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Pos (0UL)        /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_VREF_TRIM (Bit 0)           */
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_VREF_TRIM_Msk (0xffUL)     /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_VREF_TRIM (Bitfield-Mask: 0xff)*/
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Pos (8UL)      /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_IREFBM_TRIM (Bit 8)         */
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREFBM_TRIM_Msk (0x1f00UL) /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_IREFBM_TRIM (Bitfield-Mask: 0x1f)*/
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Pos (16UL)       /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_IREF_TRIM (Bit 16)          */
#define SRSS_CLK_TRIM_PILO_CTL2_PILO_IREF_TRIM_Msk (0xff0000UL) /*!< SRSS CLK_TRIM_PILO_CTL2: PILO_IREF_TRIM (Bitfield-Mask: 0xff)*/
/* ================================================  SRSS.CLK_TRIM_PILO_CTL3  ================================================ */
#define SRSS_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Pos (0UL)           /*!< SRSS CLK_TRIM_PILO_CTL3: PILO_ENGOPT (Bit 0)              */
#define SRSS_CLK_TRIM_PILO_CTL3_PILO_ENGOPT_Msk (0xffffUL)      /*!< SRSS CLK_TRIM_PILO_CTL3: PILO_ENGOPT (Bitfield-Mask: 0xffff)*/


#endif /* _CYIP_SRSS_H_ */


/* [] END OF FILE */
